"""
This file is auto generator by CodeGenerator. Don't modify it directly, instead alter tushare_api.tmpl of it.

Tushare index_weight接口
获取各类指数成分和权重，月度数据 。
数据接口-指数-指数成分和权重  https://tushare.pro/document/2?doc_id=96

@author: rmfish
"""
import pandas as pd
import requests
from bs4 import BeautifulSoup
from sqlalchemy import Integer, String, Column
from sqlalchemy.orm import sessionmaker

from tutake.api.base_dao import Base, BatchWriter, BaseDao, TutakeTableBase
from tutake.api.process import DataProcess
from tutake.api.process_client import Task
from tutake.api.ts.tushare_api import TushareAPI
from tutake.api.ts.tushare_dao import TushareDAO, create_shared_engine
from tutake.utils.config import TutakeConfig
from tutake.utils.utils import project_root


class TushareIndexStock(TutakeTableBase):
    __tablename__ = "tushare_index_stock"
    index_code = Column(String, index=True, comment='指数代码')
    con_code = Column(String, index=True, comment='成分代码')
    list_date = Column(String, index=True, comment='纳入日期')
    delist_date = Column(String, comment='剔除日期')


class IndexStock(TushareDAO, Task, DataProcess):
    instance = None

    def __new__(cls, *args, **kwargs):
        if cls.instance is None:
            cls.instance = super().__new__(cls)
        return cls.instance

    def __init__(self, config):
        self.table_name = "tushare_index_stock"
        self.database = 'tutake.duckdb'
        self.database_dir = config.get_tutake_data_dir()
        self.database_url = config.get_data_driver_url(self.database)
        self.engine = create_shared_engine(self.database_url,
                                           connect_args={
                                               'check_same_thread': False,
                                               'timeout': config.get_sqlite_timeout()
                                           })
        session_factory = sessionmaker()
        session_factory.configure(bind=self.engine)
        TushareIndexStock.__table__.create(bind=self.engine, checkfirst=True)
        self.schema = BaseDao.parquet_schema(TushareIndexStock)

        query_fields = ['index_code', 'con_code', 'start_date', 'end_date', 'limit', 'offset']
        self.tushare_fields = ["index_code", "con_code", "list_date", "delist_date"]
        entity_fields = ["index_code", "con_code", "list_date", "delist_date"]
        column_mapping = None
        TushareDAO.__init__(self, self.engine, session_factory, TushareIndexStock, self.database, self.table_name,
                            query_fields, entity_fields, column_mapping, config)
        DataProcess.__init__(self, "index_stock", config)
        Task.__init__(self, "index_stock", config)
        self.api = TushareAPI(config)

    def columns_meta(self):
        return [{
            "name": "index_code",
            "type": "String",
            "comment": "指数代码"
        }, {
            "name": "con_code",
            "type": "String",
            "comment": "成分代码"
        }, {
            "name": "list_date",
            "type": "String",
            "comment": "纳入日期"
        }, {
            "name": "delist_date",
            "type": "String",
            "comment": "剔除日期"
        }]

    def index_stock(self, fields='', **kwargs):
        """
        获取各类指数成分和权重，月度数据 。
        | Arguments:
        | index_code(str):   指数代码
        | con_code(str):   成分代码
        | start_date(str):   开始日期
        | end_date(str):   结束日期
        | limit(int):   单次返回数据长度
        | offset(int):   请求数据的开始位移量
        
        :return: DataFrame
         index_code(str)  指数代码 Y
         con_code(str)  成分代码 Y
         trade_date(str)  纳入日期 Y
         delist_date(float)  剔除日期 Y
        
        """
        return super().query(fields, **kwargs)

    def process(self, **kwargs):
        """
        同步历史数据
        :return:
        """
        return super()._process(self.fetch_and_append,
                                BatchWriter(self.engine, self.table_name, self.schema, self.database_dir), **kwargs)

    def _index_stock_cons(self, index_code: str = "000300.SH", latest=True) -> pd.DataFrame:
        """
        最新/历史股票指数的成份股目录
        https://vip.stock.finance.sina.com.cn/corp/view/vII_NewestComponent.php?page=1&indexid=399639
        :param symbol: 指数代码, 可以通过 ak.index_stock_info() 函数获取
        :type symbol: str
        :return: 最新股票指数的成份股目录
        :rtype: pandas.DataFrame
        """
        if '.' in index_code:
            symbol = index_code.split(".")[0]
        if latest:
            path = 'vII_HistoryComponent'
            columns_size = 4
        else:
            path = 'vII_NewestComponent'
            columns_size = 3
        try:
            url = f"https://vip.stock.finance.sina.com.cn/corp/go.php/{path}/indexid/{symbol}.phtml"
            r = requests.get(url)
            r.encoding = "gb2312"
            soup = BeautifulSoup(r.text, "lxml")
            page_num = (
                soup.find(attrs={"class": "table2"})
                .find("td")
                .find_all("a")[-1]["href"]
                .split("page=")[-1]
                .split("&")[0]
            )
            if page_num == "#":
                temp_df = pd.read_html(r.text, header=0, skiprows=1)[3].iloc[:, :3]
                temp_df["品种代码"] = temp_df["品种代码"].astype(str).str.zfill(6)
                return temp_df

            temp_df = pd.DataFrame()
            for page in range(1, int(page_num) + 1):
                url = f"https://vip.stock.finance.sina.com.cn/corp/view/{path}.php?page={page}&indexid={symbol}"
                r = requests.get(url)
                r.encoding = "gb2312"
                temp_df = pd.concat(
                    [temp_df, pd.read_html(r.text, header=1)[3]], ignore_index=True
                )
            temp_df = temp_df.iloc[:, :columns_size]
            temp_df["品种代码"] = temp_df["品种代码"].astype(str).str.zfill(6)
            return temp_df
        except Exception:
            return pd.DataFrame()

    def fetch_and_append(self, **kwargs):
        """
        获取tushare数据并append到数据库中
        :return: 数量行数
        """
        index_code = kwargs['index_code']
        res = self._index_stock_cons(index_code=index_code, latest=True)
        res = pd.concat([res, self._index_stock_cons(index_code=index_code, latest=False)], ignore_index=True)

        stocks = self.api.stock_basic.stock_basic(fields='ts_code,symbol', list_status=['P', 'L', 'D'])
        res = res.merge(stocks, how='left', left_on='品种代码', right_on='symbol')
        if '纳入日期' in res:
            res['list_date'] = res['纳入日期'].str.replace('-', '')
        else:
            res['list_date'] = None
        if '剔除日期' in res:
            res['delist_date'] = res['剔除日期'].str.replace('-', '')
        else:
            res['delist_date'] = None
        res['index_code'] = index_code
        res = res[res['ts_code'].notna()]
        res.rename(columns={'ts_code': "con_code"}, inplace=True)
        res = res[['index_code', 'con_code', 'list_date', 'delist_date']]
        return res

    def query_parameters(self):
        """
        同步历史数据调用的参数
        :return: list(dict)

        csi300:000300.SH
        csi500:000905.SH
        csi1000:000852.SH
        csi100:000903.SH
        csi50:000016.SH

        index_code	display_name	publish_date
        000001	上证指数	1991/7/15
        000002	A股指数	1992/2/21
        000003	B股指数	1992/2/21
        000004	工业指数	1993/5/3
        000005	商业指数	1993/5/3
        000006	地产指数	1993/5/3
        000007	公用指数	1993/5/3
        000008	综合指数	1993/5/3
        000009	上证380	2010/11/29
        000010	上证180	2002/7/1
        000011	基金指数	2000/6/9
        000012	国债指数	2003/1/2
        000013	上证企业债指数	2003/6/9
        000015	红利指数	2005/1/4
        000016	上证50	2004/1/2
        000017	新综指	2006/1/4
        000018	180金融	2007/12/10
        000019	治理指数	2008/1/2
        000020	中型综指	2008/5/12
        000021	180治理	2008/9/10
        000022	上证公司债指数	2008/11/19
        000025	180基建	2008/12/15
        000026	180资源	2008/12/15
        000027	180运输	2008/12/15
        000028	180成长	2009/1/9
        000029	180价值	2009/1/9
        000030	180R成长	2009/1/9
        000031	180R价值	2009/1/9
        000032	上证能源	2009/1/9
        000033	上证材料	2009/1/9
        000034	上证工业	2009/1/9
        000035	上证可选	2009/1/9
        000036	上证消费	2009/1/9
        000037	上证医药	2009/1/9
        000038	上证金融	2009/1/9
        000039	上证信息	2009/1/9
        000040	上证电信	2009/1/9
        000041	上证公用	2009/1/9
        000042	上证央企	2009/3/30
        000043	超大盘	2009/4/23
        000044	上证中盘	2009/7/3
        000045	上证小盘	2009/7/3
        000046	上证中小	2009/7/3
        000047	上证全指	2009/7/3
        000048	责任指数	2009/8/5
        000049	上证民企	2009/8/25
        000050	50等权	2011/1/4
        000051	180等权	2011/5/24
        000052	50基本	2012/1/9
        000053	180基本	2012/1/9
        000054	上证海外	2010/1/4
        000055	上证地企	2010/1/4
        000056	上证国企	2010/1/4
        000057	全指成长	2010/1/4
        000058	全指价值	2010/1/4
        000059	全R成长	2010/1/4
        000060	全R价值	2010/1/4
        000061	沪企债30	2010/1/4
        000062	上证沪企	2010/1/4
        000063	上证周期	2010/2/3
        000064	非周期	2010/2/3
        000065	上证龙头	2010/2/9
        000066	上证商品	2010/4/30
        000067	上证新兴	2010/4/30
        000068	上证资源	2010/5/28
        000069	消费80	2010/5/28
        000070	能源等权	2010/8/18
        000071	材料等权	2010/8/18
        000072	工业等权	2010/8/18
        000073	可选等权	2010/8/18
        000074	消费等权	2010/8/18
        000075	医药等权	2010/8/18
        000076	金融等权	2010/8/18
        000077	信息等权	2010/8/18
        000078	电信等权	2010/8/18
        000079	公用等权	2010/8/18
        000090	上证流通	2010/12/2
        000091	沪财中小	2011/4/6
        000092	资源50	2011/5/10
        000093	180分层	2011/5/24
        000094	上证上游	2011/5/10
        000095	上证中游	2011/5/10
        000096	上证下游	2011/5/10
        000097	高端装备	2011/5/24
        000098	上证F200	2011/7/1
        000099	上证F300	2011/7/1
        000100	上证F500	2011/7/1
        000101	5年信用	2013/4/1
        000102	沪投资品	2011/6/13
        000103	沪消费品	2011/6/13
        000104	380能源	2011/6/13
        000105	380材料	2011/6/13
        000106	380工业	2011/6/13
        000107	380可选	2011/6/13
        000108	380消费	2011/6/13
        000109	380医药	2011/6/13
        000110	380金融	2011/6/13
        000111	380信息	2011/6/13
        000112	380电信	2011/6/13
        000113	380公用	2011/6/13
        000114	持续产业	2011/8/22
        000115	380等权	2011/8/12
        000116	信用100	2013/2/26
        000117	380成长	2011/10/18
        000118	380价值	2011/10/18
        000119	380R成长	2011/10/18
        000120	380R价值	2011/10/18
        000121	医药主题	2011/10/18
        000122	农业主题	2011/10/18
        000123	180动态	2013/2/8
        000125	180稳定	2013/2/8
        000126	消费50	2011/12/9
        000128	380基本	2012/1/9
        000129	180波动	2012/1/9
        000130	380波动	2012/1/9
        000131	上证高新	2012/2/10
        000132	上证100	2012/4/20
        000133	上证150	2012/4/20
        000134	上证银行	2012/5/29
        000135	180高贝	2012/8/6
        000136	180低贝	2012/8/6
        000137	380高贝	2012/8/6
        000138	380低贝	2012/8/6
        000139	上证转债	2012/9/12
        000141	380动态	2013/2/8
        000142	380稳定	2013/2/8
        000145	优势资源	2012/5/29
        000146	优势制造	2012/5/29
        000147	优势消费	2012/5/29
        000148	消费领先	2012/5/29
        000149	180红利	2012/7/20
        000150	380红利	2012/7/20
        000151	上国红利	2012/7/20
        000152	上央红利	2012/7/20
        000153	上民红利	2012/7/20
        000155	市值百强	2012/7/20
        000158	上证环保	2012/9/25
        000159	上证沪股通指数	2014/11/17
        000160	上证一带一路主题指数	2015/6/24
        000161	上证中国制造2025主题指数	2015/10/29
        000162	上证互联网+主题指数	2015/10/29
        000171	新兴成指	2017/1/25
        000188	中国波指	2016/11/28
        000300	沪深300	2005/4/8
        000801	资源80	2011/11/8
        000802	500沪市	2011/11/8
        000803	300波动	2012/1/9
        000804	500波动	2012/1/9
        000805	A股资源	2012/1/6
        000806	消费服务	2012/2/10
        000807	食品饮料	2012/2/17
        000808	医药生物	2012/2/17
        000809	细分农业	2012/4/11
        000810	细分能源	2012/4/11
        000811	细分有色	2012/4/11
        000812	细分机械	2012/4/11
        000813	细分化工	2012/4/11
        000814	细分医药	2012/4/11
        000815	细分食品	2012/4/11
        000816	细分地产	2012/4/11
        000817	兴证海峡	2011/9/27
        000818	细分金融	2012/4/11
        000819	有色金属	2012/5/9
        000820	煤炭指数	2012/5/9
        000821	300红利	2012/7/20
        000822	500红利	2012/7/20
        000823	中证800有色金属指数	2012/12/21
        000824	国企红利	2012/7/20
        000825	央企红利	2012/7/20
        000826	民企红利	2012/7/20
        000827	中证环保	2012/9/25
        000828	300高贝	2012/8/6
        000829	300低贝	2012/8/6
        000830	500高贝	2012/8/6
        000831	500低贝	2012/8/6
        000832	中证转债	2012/9/12
        000833	中高企债	2012/9/10
        000838	创业价值	2012/9/26
        000839	浙企综指	2012/11/9
        000840	浙江民企	2012/11/9
        000841	800医药	2012/12/21
        000842	800等权	2012/12/21
        000843	300动态	2013/1/7
        000844	300稳定	2013/1/7
        000846	ESG100	2012/10/16
        000847	中证腾安价值100指数	2013/11/18
        000849	沪深300非银行金融指数	2012/12/21
        000850	沪深300有色金属指数	2012/12/21
        000851	中证百度百发策略100指数	2014/7/30
        000852	中证1000指数	2014/10/17
        000853	中证申万一带一路主题投资指数	2015/4/23
        000854	500原料	2013/11/6
        000855	央视财经500指数	2014/11/3
        000856	500工业	2013/11/6
        000857	500医药	2013/11/6
        000858	500信息	2013/11/6
        000891	中国战略新兴产业综合指数	2017/1/25
        000901	小康指数	2010/4/1
        000902	中证流通	2006/2/27
        000903	中证100	2006/5/29
        000904	中证200	2007/1/15
        000905	中证500	2007/1/15
        000906	中证800	2007/1/15
        000907	中证700	2007/1/15
        000908	300能源	2007/7/2
        000909	300材料	2007/7/2
        000910	300工业	2007/7/2
        000911	300可选	2007/7/2
        000912	300消费	2007/7/2
        000913	300医药	2007/7/2
        000914	300金融	2007/7/2
        000915	300信息	2007/7/2
        000916	300电信	2007/7/2
        000917	300公用	2007/7/2
        000918	300成长	2008/1/21
        000919	300价值	2008/1/21
        000920	300R成长	2008/1/21
        000921	300R价值	2008/1/21
        000922	中证红利	2008/5/26
        000923	公司债	2008/11/19
        000925	基本面50	2009/2/26
        000926	中证央企	2009/3/30
        000927	央企100	2009/3/30
        000928	中证能源	2009/7/3
        000929	中证材料	2009/7/3
        000930	中证工业	2009/7/3
        000931	中证可选	2009/7/3
        000932	中证消费	2009/7/3
        000933	中证医药	2009/7/3
        000934	中证金融	2009/7/3
        000935	中证信息	2009/7/3
        000936	中证电信	2009/7/3
        000937	中证公用	2009/7/3
        000938	中证民企	2009/8/25
        000939	民企200	2009/8/25
        000940	财富大盘	2009/9/25
        000941	新能源	2009/10/28
        000942	内地消费	2009/10/28
        000943	内地基建	2009/10/28
        000944	内地资源	2009/10/28
        000945	内地运输	2009/10/28
        000946	内地金融	2009/10/28
        000947	内地银行	2009/10/28
        000948	内地地产	2009/10/28
        000949	内地农业	2009/10/28
        000950	300基建	2009/10/28
        000951	300银行	2009/10/28
        000952	300地产	2009/10/28
        000953	中证地企	2010/2/9
        000954	地企100	2010/2/9
        000955	中证国企	2010/2/9
        000956	国企200	2010/2/9
        000957	300运输	2009/6/16
        000958	创业成长	2010/3/24
        000959	银河99	2010/2/9
        000960	中证龙头	2010/2/9
        000961	中证上游	2010/4/16
        000962	中证中游	2010/4/16
        000963	中证下游	2010/4/16
        000964	中证新兴	2010/4/30
        000965	基本200	2010/6/2
        000966	基本400	2010/6/2
        000967	基本600	2010/6/2
        000968	300周期	2010/5/28
        000969	300非周	2010/5/28
        000970	ESG40	2010/9/17
        000971	等权90	2010/12/2
        000972	300沪市	2010/12/2
        000973	技术领先	2011/1/4
        000974	中证800金融指数	2013/5/9
        000975	钱江30	2014/1/2
        000976	新华金牛	2014/2/18
        000977	内地低碳	2011/1/21
        000978	医药100	2011/3/18
        000979	大宗商品	2011/8/22
        000980	中证超大	2011/5/10
        000981	300分层	2011/6/13
        000982	500等权	2011/6/13
        000983	智能资产	2011/6/17
        000984	300等权	2011/8/2
        000985	中证全指	2011/8/2
        000986	全指能源	2011/8/2
        000987	全指材料	2011/8/2
        000988	全指工业	2011/8/2
        000989	全指可选	2011/8/2
        000990	全指消费	2011/8/2
        000991	全指医药	2011/8/2
        000992	全指金融	2011/8/2
        000993	全指信息	2011/8/2
        000994	全指电信	2011/8/2
        000995	全指公用	2011/8/2
        000996	领先行业	2011/8/2
        000997	大消费	2011/11/11
        000998	中证TMT	2011/11/8
        000999	中证两岸三地500指数	2010/1/18
        399001	深证成指	1995/1/23
        399002	深成指R	1995/1/23
        399003	成份B指	1995/1/23
        399004	深证100R	2003/1/2
        399005	中小板指	2006/1/24
        399006	创业板指	2010/6/1
        399007	深证300	2009/11/4
        399008	中小300	2010/3/22
        399009	深证200	2011/9/1
        399010	深证700	2011/9/1
        399011	深证1000	2011/9/1
        399012	创业300	2013/1/7
        399013	深市精选	2014/5/30
        399015	深证中小创新指数	2015/3/24
        399016	深证创新指数	2016/12/1
        399017	中小板创新指数	2016/12/1
        399018	创业板创新指数	2016/12/1
        399050	创新引擎	2018/7/31
        399100	新指数	2006/2/16
        399101	中小板综	2005/12/1
        399102	创业板综合指数	2010/8/20
        399103	乐富指数	2011/12/2
        399106	深证综指	1991/4/4
        399107	深证A指	1992/10/4
        399108	深证B指	1992/10/6
        399231	农林指数	2013/3/4
        399232	采矿指数	2013/3/4
        399233	制造指数	2013/3/4
        399234	水电指数	2013/3/4
        399235	建筑指数	2013/3/4
        399236	批零指数	2013/3/4
        399237	运输指数	2013/3/4
        399238	餐饮指数	2013/3/4
        399239	IT指数	2013/3/4
        399240	金融指数	2013/3/4
        399241	地产指数	2013/3/4
        399242	商务指数	2013/3/4
        399243	科研指数	2013/3/4
        399244	公共指数	2013/3/4
        399248	文化指数	2013/3/4
        399249	综企指数	2013/3/4
        399286	区块链50	2019/12/23
        399290	深转交债	2019/6/6
        399291	创精选88	2019/11/6
        399292	民企发展	2019/3/5
        399293	创业大盘	2019/4/18
        399294	中小创Q	2019/6/6
        399295	创业蓝筹	2019/1/23
        399296	创成长	2019/1/23
        399298	深证中高等级信用债指数	2014/9/25
        399299	深证中低等级信用债指数	2014/9/25
        399300	沪深300	2005/4/8
        399301	深信用债	2013/1/11
        399302	深公司债	2013/1/11
        399303	国证2000	2014/3/28
        399305	基金指数	2000/7/3
        399306	深证ETF	2011/12/2
        399307	深证转债	2014/8/27
        399310	国证50	2005/9/5
        399311	国证1000	2005/2/3
        399312	国证300	2005/2/3
        399313	巨潮100	2005/2/3
        399314	巨潮大盘	2005/2/3
        399315	巨潮中盘	2005/2/3
        399316	巨潮小盘	2005/2/3
        399317	国证A指	2005/2/3
        399318	巨潮B股指数	2005/2/3
        399319	资源优势	2005/1/4
        399320	国证服务	2005/1/4
        399321	国证红利	2005/1/4
        399322	国证治理	2005/12/12
        399324	深证红利	2006/1/24
        399326	成长40	2006/1/24
        399328	深证治理	2006/1/24
        399330	深证100	2006/1/24
        399332	深证创新(旧)	2006/2/27
        399333	中小板R	2006/12/27
        399335	深证央企	2009/8/3
        399337	深证民营	2009/8/3
        399339	深证科技	2009/8/3
        399341	深证责任	2009/8/3
        399344	深证300R	2009/11/4
        399346	深证成长	2009/11/4
        399348	深证价值	2009/11/4
        399350	皖江30	2012/12/18
        399351	深报指数	2004/9/1
        399352	深报综指	2005/2/3
        399353	国证物流	2005/3/1
        399354	分析师指数	2006/11/25
        399355	长三角	2007/7/2
        399356	珠三角	2007/7/2
        399357	环渤海	2007/7/2
        399358	泰达指数	2008/1/2
        399359	国证基建	2009/8/3
        399360	国证装备	2009/8/3
        399361	国证商业	2009/8/3
        399362	国证民营	2009/8/3
        399363	计算机指	2009/8/3
        399364	中金消费	2009/8/3
        399365	国证农业	2009/11/4
        399366	国证大宗	2009/11/4
        399367	巨潮地产	2009/11/4
        399368	国证军工	2009/11/4
        399369	CBN-兴全	2009/11/4
        399370	国证成长	2010/1/4
        399371	国证价值	2010/1/4
        399372	大盘成长	2010/1/4
        399373	大盘价值	2010/1/4
        399374	中盘成长	2010/1/4
        399375	中盘价值	2010/1/4
        399376	小盘成长	2010/1/4
        399377	小盘价值	2010/1/4
        399378	南方低碳	2010/9/20
        399379	国证基金	2011/12/2
        399380	国证ETF	2011/12/2
        399381	1000能源	2011/12/2
        399382	1000材料	2011/12/2
        399383	1000工业	2011/12/2
        399384	1000可选	2011/12/2
        399385	1000消费	2011/12/2
        399386	1000医药	2011/12/2
        399387	1000金融	2011/12/2
        399388	1000信息	2011/12/2
        399389	国证通信	2011/12/2
        399390	1000公用	2011/12/2
        399391	投资时钟	2012/3/26
        399392	国证新兴	2012/3/28
        399393	国证地产	2012/8/20
        399394	国证医药	2012/10/29
        399395	国证有色	2012/10/29
        399396	国证食品	2012/10/29
        399397	OCT文化	2012/11/9
        399398	绩效指数	2012/11/19
        399399	中经GDP	2012/11/23
        399400	大中盘	2013/3/20
        399401	中小盘	2013/3/20
        399402	周期100	2013/10/28
        399403	防御100	2013/10/28
        399404	大盘低波	2013/12/5
        399405	大盘高贝	2013/12/5
        399406	中盘低波	2013/12/5
        399407	中盘高贝	2013/12/5
        399408	小盘低波	2013/12/5
        399409	小盘高贝	2013/12/5
        399410	苏州率先	2013/12/12
        399411	红利100	2014/4/10
        399412	国证新能	2014/5/16
        399413	国证转债	2014/8/27
        399415	I100	2014/9/12
        399416	I300	2014/9/12
        399417	国证新能源汽车指数	2014/9/24
        399418	国证国家安全指数	2014/11/21
        399419	国证高铁指数	2014/12/10
        399420	国证保险证券指数	2014/12/10
        399423	中关村50指数	2015/2/5
        399427	国证德高行专利领先指数	2015/2/17
        399428	国证定向增发指数	2015/2/17
        399429	新丝路指数	2015/1/8
        399431	国证银行行业指数	2014/12/30
        399432	国证汽车与汽车零配件行业指数	2014/12/30
        399433	国证交通运输行业指数	2014/12/30
        399434	国证传媒行业指数	2014/12/30
        399435	国证农牧渔产品行业指数	2014/12/30
        399436	国证煤炭行业指数	2014/12/30
        399437	国证证券行业指数	2014/12/30
        399438	国证电力公用事业行业指数	2014/12/30
        399439	国证石油天然气行业指数	2014/12/30
        399440	国证黑色金属行业指数	2014/12/30
        399441	国证生物医药指数	2015/1/20
        399481	企债指数	2003/1/2
        399550	央视50	2012/6/6
        399551	央视创新	2013/6/6
        399552	央视成长	2013/6/6
        399553	央视回报	2013/6/6
        399554	央视治理	2013/6/6
        399555	央视责任	2013/6/6
        399556	央视生态	2014/6/6
        399557	央视文化	2014/6/6
        399602	中小成长	2010/5/24
        399604	中小价值	2010/5/24
        399606	创业板R	2010/6/1
        399608	科技100	2010/10/18
        399610	TMT50	2010/11/8
        399611	中创100R	2011/2/28
        399612	中创100	2011/2/28
        399613	深证能源	2011/6/15
        399614	深证材料	2011/6/15
        399615	深证工业	2011/6/15
        399616	深证可选	2011/6/15
        399617	深证消费	2011/6/15
        399618	深证医药	2011/6/15
        399619	深证金融	2011/6/15
        399620	深证信息	2011/6/15
        399621	深证电信	2011/6/15
        399622	深证公用	2011/6/15
        399623	中小基础	2011/7/25
        399624	中创400	2011/8/15
        399625	中创500	2011/8/15
        399626	中创成长	2011/8/15
        399627	中创价值	2011/8/15
        399628	700成长	2011/9/1
        399629	700价值	2011/9/1
        399630	1000成长	2011/9/1
        399631	1000价值	2011/9/1
        399632	深100EW	2011/10/28
        399633	深300EW	2011/10/28
        399634	中小板EW	2011/10/28
        399635	创业板EW	2011/10/28
        399636	深证装备	2011/11/15
        399637	深证地产	2011/11/15
        399638	深证环保	2011/11/15
        399639	深证大宗	2011/11/15
        399640	创业基础	2012/1/16
        399641	深证新兴	2012/2/1
        399642	中小新兴	2012/2/1
        399643	创业新兴	2012/2/1
        399644	深证时钟	2012/3/26
        399645	100低波	2012/6/12
        399646	深消费50	2012/8/6
        399647	深医药50	2012/8/6
        399648	深证GDP	2012/8/8
        399649	中小红利	2012/8/20
        399650	中小治理	2012/8/20
        399651	中小责任	2012/8/20
        399652	中创高新	2012/9/17
        399653	深证龙头	2012/9/25
        399654	深证文化	2012/11/9
        399655	深证绩效	2012/11/19
        399656	100绩效	2012/11/19
        399657	300绩效	2012/11/19
        399658	中小绩效	2012/11/19
        399659	深成指EW	2012/11/23
        399660	中创EW	2012/11/23
        399661	深证低波	2012/12/20
        399662	深证高贝	2012/12/20
        399663	中小低波	2012/12/20
        399664	中小高贝	2012/12/20
        399665	中创低波	2012/12/20
        399666	中创高贝	2012/12/20
        399667	创业板G	2013/1/7
        399668	创业板V	2013/1/7
        399669	深证农业	2013/6/24
        399670	深周期50	2013/10/28
        399671	深防御50	2013/10/28
        399672	深红利50	2014/4/10
        399673	创业板50	2014/6/18
        399674	深A医药卫生指数	2015/6/8
        399675	深A软件与互联网指数	2015/6/8
        399676	深A医药卫生等权指数	2015/6/8
        399677	深A软件与互联网等权指数	2015/6/8
        399678	深证次新股指数	2015/6/18
        399679	深证200指数	2015/6/18
        399680	深成能源行业指数	2015/8/31
        399681	深成原材料行业指数	2015/8/31
        399682	深成工业行业指数	2015/8/31
        399683	深成可选消费行业指数	2015/8/31
        399684	深成主要消费行业指数	2015/8/31
        399685	深成医药卫生行业指数	2015/8/31
        399686	深成金融地产行业指数	2015/8/31
        399687	深成信息技术行业指数	2015/8/31
        399688	深成电信业务行业指数	2015/8/31
        399689	深成公用事业行业指数	2015/8/31
        399690	深证中小板专利领先指数	2016/5/23
        399691	深证创业板专利领先指数	2016/5/23
        399692	创业300低波动率指数	2016/12/20
        399693	安防产业	2016/6/20
        399694	创业高贝	2016/12/20
        399695	深证节能环保指数	2017/4/28
        399696	深证创投	2016/10/21
        399697	中关村60	2017/1/10
        399698	深证优势成长	2017/6/15
        399699	金融科技	2017/6/9
        399701	深证F60	2010/5/10
        399702	深证F120	2010/5/10
        399703	深证F200	2010/5/10
        399704	深证上游	2011/10/18
        399705	深证中游	2011/10/18
        399706	深证下游	2011/10/18
        399707	中证申万证券行业指数	2015/4/16
        399802	500深市	2012/9/5
        399803	中证工业4.0指数	2015/3/10
        399804	中证体育产业指数	2015/2/9
        399805	中证互联网金融指数	2015/2/10
        399806	中证环境治理指数	2014/7/21
        399807	中证高铁产业指数	2015/1/20
        399808	中证新能源指数	2015/2/10
        399809	中证方正富邦保险主题指数	2015/2/13
        399810	中证申万传媒行业投资指数	2015/8/3
        399811	中证申万电子行业投资指数	2015/8/3
        399812	中证养老产业指数	2014/6/6
        399813	中证国防安全指数	2015/1/29
        399814	中证大农业指数	2014/7/22
        399817	中证阿拉善生态主题100指数	2015/10/21
        399901	中证南方小康产业指数	2010/4/1
        399902	中证流通指数	2006/2/27
        399903	中证100指数	2006/5/29
        399904	中证中盘200指数	2007/1/15
        399905	中证500	2007/1/15
        399906	中证800指数	2007/1/15
        399907	中证中小盘700指数	2007/1/15
        399908	沪深300能源指数	2007/7/2
        399909	沪深300原材料指数	2007/7/2
        399910	沪深300工业指数	2007/7/2
        399911	沪深300可选消费指数	2007/7/2
        399912	沪深300主要消费指数	2007/7/2
        399913	沪深300医药卫生指数	2007/7/2
        399914	沪深300金融地产指数	2007/7/2
        399915	沪深300信息技术指数	2007/7/2
        399916	沪深300电信业务指数	2007/7/2
        399917	沪深300公用事业指数	2007/7/2
        399918	沪深300成长指数	2008/1/21
        399919	沪深300价值指数	2008/1/21
        399920	沪深300相对成长指数	2008/1/21
        399922	中证红利指数	2008/5/26
        399923	公司债	2008/11/19
        399925	中证锐联基本面50指数	2009/2/26
        399926	中证中央企业综合指数	2009/3/30
        399927	中证中央企业100指数	2009/3/30
        399928	中证能源指数	2009/7/3
        399929	中证原材料指数	2009/7/3
        399930	中证工业指数	2009/7/3
        399931	中证可选消费指数	2009/7/3
        399932	中证主要消费指数	2009/7/3
        399933	中证医药卫生指数	2009/7/3
        399934	中证金融地产指数	2009/7/3
        399935	中证信息技术指数	2009/7/3
        399936	中证电信业务指数	2009/7/3
        399937	中证公用事业指数	2009/7/3
        399938	中证民营企业综合指数	2009/8/25
        399939	中证民营企业200指数	2009/8/25
        399940	中证财富大盘指数	2009/9/25
        399941	中证内地新能源主题指数	2009/10/28
        399942	中证内地消费主题指数	2009/10/28
        399943	中证内地基建主题指数	2009/10/28
        399944	中证内地资源主题指数	2009/10/28
        399945	中证内地运输主题指数	2009/10/28
        399946	中证内地金融主题指数	2009/10/28
        399947	中证内地银行主题指数	2009/10/28
        399948	中证内地地产主题指数	2009/10/28
        399949	中证内地农业主题指数	2009/10/28
        399950	沪深300基建主题指数	2009/10/28
        399951	沪深300银行指数	2009/10/28
        399952	沪深300地产指数	2009/10/28
        399953	中证地方国有企业综合指数	2010/2/9
        399954	中证地方国有企业100指数	2010/2/9
        399955	中证国有企业综合指数	2010/2/9
        399956	中证国有企业200指数	2010/2/9
        399957	沪深300运输指数	2009/6/16
        399958	中证创业成长指数	2010/3/24
        399959	军工指数	2011/8/30
        399960	中证龙头企业指数	2010/2/9
        399961	中证上游资源产业指数	2010/4/16
        399962	中证中游制造产业指数	2010/4/16
        399963	中证下游消费与服务产业指数	2010/4/16
        399964	中证新兴产业指数	2010/4/30
        399965	800地产	2014/4/4
        399966	800非银	2014/4/4
        399967	中证军工	2013/12/26
        399968	沪深300周期行业指数	2010/5/28
        399969	沪深300非周期行业指数	2010/5/28
        399970	中证移动互联网指数	2014/5/5
        399971	中证传媒指数	2014/4/15
        399972	300深市	2012/6/21
        399973	中证国防指数	2014/4/15
        399974	中证国有企业改革指数	2014/8/7
        399975	中证全指证券公司指数(四级行业)	2013/7/15
        399976	中证新能源汽车指数	2014/11/28
        399977	中证内地低碳经济主题指数	2011/1/21
        399978	中证医药100指数	2011/3/18
        399979	中证大宗商品股票指数	2011/8/22
        399980	中证超级大盘指数	2011/5/10
        399981	沪深300行业分层等权重指数	2011/6/13
        399982	中证500等权重指数	2011/6/13
        399983	沪深300地产等权重指数	2013/11/22
        399984	沪深300等权重指数	2011/8/2
        399985	中证全指指数	2011/8/2
        399986	中证银行指数	2013/7/15
        399987	中证酒指数	2014/12/10
        399989	中证医疗指数	2014/10/31
        399990	中证煤炭等权指数	2015/1/21
        399991	中证一带一路主题指数	2015/2/16
        399992	中证万得并购重组指数	2015/5/8
        399993	中证万得生物科技指数	2015/5/8
        399994	中证信息安全主题指数	2015/3/12
        399995	中证基建工程指数	2015/3/12
        399996	中证智能家居指数	2014/9/17
        399997	中证白酒指数	2015/1/21
        399998	中证煤炭指数	2015/2/13
        """
        return [{"index_code": "000300.SH"}, {"index_code": "000905.SH"}, {"index_code": "000852.SH"},
                {"index_code": "000903.SH"}, {"index_code": "000016.SH"}]

    def prepare(self):
        self.delete_all()

    def default_limit(self) -> str:
        return "10000"

    def default_order_by(self) -> str:
        return 'index_code,list_date'


if __name__ == '__main__':
    pd.set_option('display.max_columns', 50)  # 显示列数
    pd.set_option('display.width', 100)
    config = TutakeConfig(project_root())

    api = IndexStock(config)
    print(api.process())  # 同步增量数据
    print(api.index_stock(con_code='T00018.SH'))
